In [219]:
import numpy as np
import pandas as pd
import matplotlib as plt

x = pd.read_csv('data/train.csv')
y = x.Survived
x.drop(columns=['Survived', 'Ticket', 'Name', 'Cabin', 'PassengerId', 'Fare'], inplace=True)
x

     Pclass     Sex   Age  SibSp  Parch      Fare Embarked
0         3    male  22.0      1      0  0.860338        S
1         1  female  38.0      1      0  1.852988        C
2         3  female  26.0      0      0  0.898999        S
3         1  female  35.0      1      0  1.725095        S
4         3    male  35.0      0      0  0.905796        S
..      ...     ...   ...    ...    ...       ...      ...
886       2    male  27.0      0      0  1.113943        S
887       1  female  19.0      0      0  1.477121        S
888       3  female   NaN      1      2  1.370143        S
889       1    male  26.0      0      0  1.477121        C
890       3    male  32.0      0      0  0.889302        Q

[891 rows x 7 columns]

In [220]:
x.insert(0, 'Bias', 1)
x.replace(to_replace='male', value = 1, inplace=True)
x.replace(to_replace='female', value = 0, inplace=True)
x.replace(to_replace='S', value = 0, inplace=True)
x.replace(to_replace='C', value = 1, inplace=True)
x.replace(to_replace='Q', value = 2, inplace=True)
x

     Bias  Pclass  Sex   Age  SibSp  Parch      Fare  Embarked
0       1       3    1  22.0      1      0  0.860338       0.0
1       1       1    0  38.0      1      0  1.852988       1.0
2       1       3    0  26.0      0      0  0.898999       0.0
3       1       1    0  35.0      1      0  1.725095       0.0
4       1       3    1  35.0      0      0  0.905796       0.0
..    ...     ...  ...   ...    ...    ...       ...       ...
886     1       2    1  27.0      0      0  1.113943       0.0
887     1       1    0  19.0      0      0  1.477121       0.0
888     1       3    0   NaN      1      2  1.370143       0.0
889     1       1    1  26.0      0      0  1.477121       1.0
890     1       3    1  32.0      0      0  0.889302       2.0

[891 rows x 8 columns]

In [223]:
theta = np.ones(len(x.columns))
print(theta.shape)
print(x.shape)
print(x.min())
print(x['Fare'])
# sum = x.dot(theta)
# sum.sum()
# sum.loc[sum[0] != -inf, sum[0]].sum()

(8,)
(891, 8)
Bias        1.00
Pclass      1.00
Sex         0.00
Age         0.42
SibSp       0.00
Parch       0.00
Fare        -inf
Embarked    0.00
dtype: float64
0      0.860338
1      1.852988
2      0.898999
3      1.725095
4      0.905796
         ...
886    1.113943
887    1.477121
888    1.370143
889    1.477121
890    0.889302
Name: Fare, Length: 891, dtype: float64